[
  {
    "id": 1,
    "title": "Spaghetti Aglio e Olio",
    "content": "Spaghetti Aglio e Olio is a simple Italian pasta dish made with garlic, olive oil, and chili flakes. It is quick to prepare and is a classic favorite among pasta lovers.",
    "authorFirst": "Giovanni",
    "authorLast": "Rossi",
    "creationDate": "2023-01-10T11:00:00",
    "lastModified": "2023-01-15T09:30:00",
    "viewStatistic": { "views": 345 },
    "ingredients": [
      "spaghetti",
      "olive oil",
      "garlic",
      "chili flakes",
      "parsley",
      "salt"
    ],
    "steps": "1. Cook spaghetti in salted water. 2. In a pan, heat olive oil and sauté minced garlic until golden. 3. Add chili flakes. 4. Drain pasta and toss it in the pan. 5. Garnish with parsley and serve.",
    "cookTime": 20,
    "calories": 350,
    "cuisine": "Italian",
    "yield": 2
  },
  {
    "id": 2,
    "title": "Chicken Tikka Masala",
    "content": "A popular Indian dish, Chicken Tikka Masala consists of marinated chicken chunks in a spiced curry sauce. It is best served with rice or naan bread.",
    "authorFirst": "Aditi",
    "authorLast": "Sharma",
    "creationDate": "2023-02-05T15:30:00",
    "lastModified": "2023-02-10T14:00:00",
    "viewStatistic": { "views": 720 },
    "ingredients": [
      "chicken breast",
      "yogurt",
      "garam masala",
      "curry powder",
      "tomato puree",
      "cream",
      "onion",
      "garlic",
      "ginger",
      "cilantro"
    ],
    "steps": "1. Marinate chicken in yogurt and spices. 2. Cook chicken until browned. 3. In a separate pan, sauté onions, garlic, and ginger. 4. Add tomato puree and cream, then combine with chicken. 5. Simmer and serve with cilantro.",
    "cookTime": 45,
    "calories": 600,
    "cuisine": "Indian",
    "yield": 4
  },
  {
    "id": 3,
    "title": "Vegetable Stir-Fry",
    "content": "This vibrant vegetable stir-fry is quick, healthy, and full of flavor. It can be customized with any vegetables you have on hand.",
    "authorFirst": "Li",
    "authorLast": "Chen",
    "creationDate": "2023-03-12T10:15:00",
    "lastModified": "2023-03-15T12:00:00",
    "viewStatistic": { "views": 185 },
    "ingredients": [
      "bell peppers",
      "broccoli",
      "carrots",
      "soy sauce",
      "ginger",
      "garlic",
      "sesame oil",
      "rice"
    ],
    "steps": "1. Prepare vegetables and rice. 2. In a wok, heat sesame oil. 3. Sauté garlic and ginger. 4. Add vegetables and stir-fry until tender. 5. Stir in soy sauce and serve over rice.",
    "cookTime": 25,
    "calories": 280,
    "cuisine": "Asian",
    "yield": 2
  },
  {
    "id": 4,
    "title": "Classic Beef Tacos",
    "content": "These classic beef tacos are perfect for a quick weeknight dinner. Customize with your favorite toppings for a delicious meal.",
    "authorFirst": "Carlos",
    "authorLast": "Gonzalez",
    "creationDate": "2023-04-20T17:00:00",
    "lastModified": "2023-04-25T10:45:00",
    "viewStatistic": { "views": 410 },
    "ingredients": [
      "ground beef",
      "taco seasoning",
      "taco shells",
      "lettuce",
      "tomato",
      "cheese",
      "sour cream"
    ],
    "steps": "1. Brown ground beef in a skillet. 2. Stir in taco seasoning and water. 3. Simmer until thickened. 4. Fill taco shells with beef and top with lettuce, tomato, cheese, and sour cream.",
    "cookTime": 30,
    "calories": 400,
    "cuisine": "Mexican",
    "yield": 4
  },
  {
    "id": 5,
    "title": "Banana Bread",
    "content": "Banana bread is a delicious and easy-to-make treat that uses overripe bananas. It’s perfect for breakfast or as a snack.",
    "authorFirst": "Sarah",
    "authorLast": "Johnson",
    "creationDate": "2023-05-18T13:00:00",
    "lastModified": "2023-05-20T14:30:00",
    "viewStatistic": { "views": 590 },
    "ingredients": [
      "overripe bananas",
      "flour",
      "sugar",
      "butter",
      "eggs",
      "baking soda",
      "vanilla extract"
    ],
    "steps": "1. Preheat oven to 350°F (175°C). 2. Mash bananas in a bowl. 3. Mix in melted butter, sugar, eggs, and vanilla. 4. Stir in flour and baking soda. 5. Pour into a loaf pan and bake for 60 minutes.",
    "cookTime": 60,
    "calories": 250,
    "cuisine": "American",
    "yield": 1
  },
  {
    "id": 6,
    "title": "Grilled Cheese Sandwich",
    "content": "As a classic dish enjoyed by almost anyone in the world, the grilled cheese sandwich is as simple to make as its name. Composed of only bread, cheese, and butter, this is a simple yet delicious food that anyone can enjoy.",
    "authorFirst": "Jack",
    "authorLast": "Russell",
    "creationDate": "2023-09-12T11:00:00",
    "lastModified": "2023-10-01T09:30:00",
    "viewStatistic": { "views": 1223 },
    "ingredients": [
      "bread",
      "cheese",
      "butter"
    ],
    "steps": "1. Preheat your pan on the stove to a low heat. 2. Spead butter on all sides of your two slices of bread. 3. Place one slice of bread on the pan and cover with a cheese slice. 4. When the bread slice is toasted, place the other on top and flip. 5. Remove the sandwich when the other slice is toasted and serve.",
    "cookTime": 15,
    "calories": 200,
    "cuisine": "American",
    "yield": 1
  },
  {
    "id": 7,
    "title": "Omelette",
    "content": "This dish is the dream of any egg lovers out there. With culinary variety of options that can come about from the flexibility of an omelette, the delicious opportunities are countless. You won't be disappointed with this breakfast classic.",
    "authorFirst": "Ava",
    "authorLast": "Malik",
    "creationDate": "2023-11-22T11:00:00",
    "lastModified": "2023-12-11T09:30:00",
    "viewStatistic": { "views": 501 },
    "ingredients": [
      "eggs",
      "cheese",
      "sausages",
      "onions",
      "bell peppers"
    ],
    "steps": "1. Preheat your pan on the stove to a medium heat. 2. Crack your eggs and place them in the pan. 3. When the eggs are halfway cooked, add the sausages, cheese, onions, and bell peppers. 4. Mix the omelette up until the eggs are fully cooked. 5. Plate and serve.",
    "cookTime": 45,
    "calories": 400,
    "cuisine": "American",
    "yield": 3
  },
  {
    "id": 8,
    "title": "Spam Musubi",
    "content": "Spam Musubi is a dish with roots in Hawaiian culture. With the Spam meat as its base, it is best described as a larger version of sushi with Spam instead of raw fish. This is a delicious treat you can keep with you as you travel.",
    "authorFirst": "Miku",
    "authorLast": "Tanaka",
    "creationDate": "2023-09-12T11:00:00",
    "lastModified": "2023-10-01T09:30:00",
    "viewStatistic": { "views": 552 },
    "ingredients": [
      "rice",
      "seaweed",
      "spam"
    ],
    "steps": "1. Cook your spam until you see the golden crusting. 2. Lay out a strip of seaweed and press rice on top of it. 3. Place the spam on the rice and wrap. 4. Press the layers together for cohesion. 5. Serve or store. ",
    "cookTime": 30,
    "calories": 250,
    "cuisine": "Hawaiian",
    "yield": 1
  },
  {
    "id": 9,
    "title": "Potstickers",
    "content": "Potsticks are a classic Chinese dish that is a wrapping that encases a savory filling. As a representation of wealth, the potsticker is an essential dish to have to display Chinese cuisine, and it is simple to make.",
    "authorFirst": "Zhu",
    "authorLast": "Hongwu",
    "creationDate": "2023-03-30T11:00:00",
    "lastModified": "2023-04-22T09:30:00",
    "viewStatistic": { "views": 378 },
    "ingredients": [
      "oil",
      "water",
      "potstickers"
    ],
    "steps": "1. Place a small amount of oil and water in a pan. 2. Place your frozen potstickers in the pan. 3. Turn on the stove let the potstickers boil. 4. Once the water evaporates, move the potstickers around while they fry so they do not stick to the bottom. 5. When the potstickers are golden brown, remove and serve.",
    "cookTime": 15,
    "calories": 300,
    "cuisine": "Chinese",
    "yield": 1
  },
  {
    "id": 10,
    "title": "Fettuccine Alfredo",
    "content": "Fettuccine Alfredo is a classic Italian pasta dish that combines a delectable cream sauce with fettuccine. Almost universally enjoyed, you will have a great time eating this dish, and you will love the taste and results.",
    "authorFirst": "Tonio",
    "authorLast": "Trussardi",
    "creationDate": "1999-05-11T11:00:00",
    "lastModified": "1999-05-22T09:30:00",
    "viewStatistic": { "views": 855 },
    "ingredients": [
      "fettuccine",
      "butter",
      "cheese",
      "cream",
      "seasonings"
    ],
    "steps": "1. Boil your fettuccine in water. 2. Pour your milk and cream into a pot on low heat. 3. Melt butter and cheese into a cream and milk mixture, adding your seasonings. 4. Place the pasta in the sauce and mix thoroughly. 5. Plate and serve.",
    "cookTime": 15,
    "calories": 595,
    "cuisine": "Italian",
    "yield": 6
  }
]
